function y=robot_parameter()
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%robot_parameter.m
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%リンク2長
l2=100;%[mm]

%リンク3長
l3=100;%[mm]

%ロボットの幅
%w=100;%[mm]

%ロボットの足裏長/2(奥行き、幅は等しい)
s=40;%[mm]

%材質:アルミ
ro=2.69*10^(-3)/(10^(-2))^3;%[kg/m^3]

%重力加速度　z軸方向鉛直下向き
G=9.8;%[m/s^2]

%質量と慣性モーメント
%(1)足裏　s1_R,s1_L 
%形状:直方体　但し簡単のため足裏の高さは考えない。
b=40/2*1e-3;%[m]
c=1/2*1e-3;%[m]
a=40/2*1e-3;%[m]
M_s=2*a*2*b*2*c*ro;%[kg]
Ix_s=1/3*(b^2)*M_s;%xx軸回りイナーシャ[Kg.m^2]
Iy_s=1/3*(a^2)*M_s;%yy軸回りイナーシャ[Kg.m^2]
Iz_s=1/3*(a^2+b^2)*M_s;%zz軸回りイナーシャ[Kg.m^2]

%(2) リンク　l2_R,l3_R,l2_L,l3_L共に共通　
%形状:円柱
a=(10/2)*1e-3;%[m]
h=100e-3;%[m]
M_l23=pi*a^2*h*ro;%[kg]
Iz_l23=1/2*M_l23*a^2;%zz軸回りイナーシャ[Kg.m^2]
Ix_l23=(a^2/2+h^2/12)*M_l23;%xx軸回りイナーシャ[Kg.m^2]
Iy_l23=Ix_l23;%yy軸回りイナーシャ[Kg.m^2]

%ロボットパラメータ構造体作成
y.l2=l2;%リンク2長[mm]
y.l3=l3;%リンク3長[mm]
y.s=s;%ロボットの足裏サイズ(奥行き、幅は等しい)[mm]

y.M_s=M_s;%RS,LS　質量[kg]
y.Ix_s=Ix_s;%RS,LS xx軸回りイナーシャ[Kg.m^2]
y.Iy_s=Iy_s;%RS,LS yy軸回りイナーシャ[Kg.m^2]
y.Iz_s=Iz_s;%RS,LS zz軸回りイナーシャ[Kg.m^2]

y.M_l23=M_l23;%R3,R2,L3,L2 質量[kg]
y.Ix_l23=Ix_l23;%R3,R2,L3,L2 xx軸回りイナーシャ[Kg.m^2]
y.Iy_l23=Iy_l23;%R3,R2,L3,L2 yy軸回りイナーシャ[Kg.m^2]
y.Iz_l23=Iz_l23;%R3,R2,L3,L2 zz軸回りイナーシャ[Kg.m^2]
